Answer 1:

In [1]:
import pandas as pd

In [4]:
data= { 'Name':["Arijit","Krish","John","Rohan"],
        'Age':[24,25,26,27]}

In [5]:
data=pd.DataFrame(data)

In [7]:
data.head(3)

     Name  Age
0  Arijit   24
1   Krish   25
2    John   26

In [8]:
data.tail(3)

    Name  Age
1  Krish   25
2   John   26
3  Rohan   27

In [9]:
data.describe()

             Age
count   4.000000
mean   25.500000
std     1.290994
min    24.000000
25%    24.750000
50%    25.500000
75%    26.250000
max    27.000000

In [14]:
data.dtypes

Name    object
Age      int64
dtype: object

In [21]:
pd.Series(data['Name'])

0    Arijit
1     Krish
2      John
3     Rohan
Name: Name, dtype: object

Answer 2:

In [22]:
import pandas as pd

In [23]:
data = {'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}

In [25]:
df=pd.DataFrame(data)

In [26]:
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [44]:
for i in range (3):
    j = range(1, len(df) * 2, 2)
    df1=df.set_index(pd.Index(j))

In [45]:
df1

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

Answer 3

In [46]:
import pandas as pd

In [47]:
data={"Values":[1,2,3,4,5,6,7],
     "Rev":[9,8,7,6,5,4,3]}

In [56]:
df=pd.DataFrame(data)

In [60]:
def Sum(df):
    if "Values" in df.columns:
        values_column = df['Values']
        s=values_column.head(3).sum()
        return s

In [61]:
sm=Sum(df)

In [62]:
print(sm)

6

Answer 4

In [63]:
import pandas as pd

In [64]:
data={"Text":["This s Arijit","This is not Arijit","Welcome to PW"]}

In [65]:
df=pd.DataFrame(data)

In [69]:
def wordcount(df):
    if 'Text' in df.columns:
        df['Word_Count']=df['Text'].str.split().str.len()

In [70]:
wordcount(df)

In [72]:
df

                 Text  Word_Count
0       This s Arijit           3
1  This is not Arijit           4
2       Welcome to PW           3

Answer 5

Both DataFrame.size and DataFrame.shape are attributes of a Pandas DataFrame, but they serve different purposes: 

DataFrame.size returns the total number of elements in the DataFrame.
It is calculated as the product of the number of rows and columns in the DataFrame.
The result is a single integer representing the total size of the DataFrame.
Eg:data={"Values":[1,2,3,4,5,6,7],
         "Rev":[9,8,7,6,5,4,3]}
         DataFrame.size returns 14

DataFrame.shape returns a tuple representing the dimensions of the DataFrame.
The tuple contains two elements: the number of rows and the number of columns.
It is a more human-readable way to understand the structure of the DataFrame.
Eg:data={"Values":[1,2,3,4,5,6,7],
         "Rev":[9,8,7,6,5,4,3]}
         DataFrame.shape returns (7,2)

Answer 6

To read excel we use pd.read_excel(File_path)

Answer 7

In [73]:
import pandas as pd

In [74]:
data = {'Email': ['Arijit@gmail.com', 'Virat@gmail.com', 'Alakh@gmail.com']}

In [75]:
df = pd.DataFrame(data)

In [78]:
def username(df):
    if 'Email' in df.columns:
        df['username']=df['Email'].str.split('@').str[0]

In [79]:
username(df)

In [80]:
df

              Email username
0  Arijit@gmail.com   Arijit
1   Virat@gmail.com    Virat
2   Alakh@gmail.com    Alakh

Answer 8

In [81]:
import pandas as pd

In [82]:
data={'A':[3,8,6,2,9],
      'B':[5,2,9,3,1],
      'C':[1,7,4,5,2]}

In [83]:
df=pd.DataFrame(data)

In [84]:
def ColOps(df):
    df1=(df['A']>5) & (df['B']<10)
    return df1

In [85]:
n=ColOps(df)

In [86]:
df[n]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Answer 9

In [87]:
import pandas as pd

In [88]:
data={'Values':[1,3,5,7,9,]}

In [89]:
df=pd.DataFrame(data)

In [105]:
def Stats(df):
    meanx = df['Values'].mean()
    medianx = df['Values'].median()
    stddevx = df['Values'].std()
    print("Mean",meanx)
    print("Median",medianx)
    print("Standard Deviation",stddevx)

In [106]:
Stats(df)

Mean 5.0
Median 5.0
Standard Deviation 3.1622776601683795

Answer 10

In [107]:
import pandas as pd

In [108]:
import numpy as np

In [109]:
data = {
    'Date': pd.date_range(start='2022-01-01', end='2022-01-20'),
    'Sales': np.random.randint(50, 100, size=(20,))
}

In [110]:
df=pd.DataFrame(data)

In [112]:
def movingaverage(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values('Date')
    df = df.set_index('Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    df = df.reset_index()
    return df

In [113]:
df = movingaverage(df)

In [114]:
df

         Date  Sales  MovingAverage
0  2022-01-01     84      84.000000
1  2022-01-02     61      72.500000
2  2022-01-03     55      66.666667
3  2022-01-04     67      66.750000
4  2022-01-05     86      70.600000
5  2022-01-06     56      68.166667
6  2022-01-07     63      67.428571
7  2022-01-08     86      67.714286
8  2022-01-09     87      71.428571
9  2022-01-10     74      74.142857
10 2022-01-11     95      78.142857
11 2022-01-12     87      78.285714
12 2022-01-13     84      82.285714
13 2022-01-14     97      87.142857
14 2022-01-15     73      85.285714
15 2022-01-16     97      86.714286
16 2022-01-17     67      85.714286
17 2022-01-18     59      80.571429
18 2022-01-19     57      76.285714
19 2022-01-20     68      74.000000

Answer 11

In [115]:
import pandas as pd

In [117]:
def weekday(df):
    df['Date']=pd.to_datetime(df['Date'])
    df['WeekDay']=df['Date'].dt.day_name()
    return df

In [118]:
data={ 'Date': pd.date_range(start='2022-01-01', end='2022-01-20')}

In [120]:
df=pd.DataFrame(data)

In [121]:
df=weekday(df)

In [122]:
df

         Date    WeekDay
0  2022-01-01   Saturday
1  2022-01-02     Sunday
2  2022-01-03     Monday
3  2022-01-04    Tuesday
4  2022-01-05  Wednesday
5  2022-01-06   Thursday
6  2022-01-07     Friday
7  2022-01-08   Saturday
8  2022-01-09     Sunday
9  2022-01-10     Monday
10 2022-01-11    Tuesday
11 2022-01-12  Wednesday
12 2022-01-13   Thursday
13 2022-01-14     Friday
14 2022-01-15   Saturday
15 2022-01-16     Sunday
16 2022-01-17     Monday
17 2022-01-18    Tuesday
18 2022-01-19  Wednesday
19 2022-01-20   Thursday

Answer 12

In [123]:
import pandas as pd

In [136]:
data={ 'Date': pd.date_range(start='2023-01-01', end='2023-02-28')}

In [137]:
df=pd.DataFrame(data)

In [138]:
def daterange(df):
    df['Date'] = pd.to_datetime(df['Date'])
    start='2023-01-01'
    end='2023-01-31'
    selected_rows = df[(df['Date'] >= start) & (df['Date'] <= end)]
    return selected_rows

In [139]:
df=daterange(df)

In [141]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Answer 13

To use basic Pandas functions we must import pandas library, eg: import pandas as pd